'''
    1、任意的输入10个数字，按从大到小排序
'''
a = [23,2,4,6,78,90,56,43]
a.sort(reverse=True)
# print(a)

''' 
2、"在一个月黑风高的夜晚，一个小男生用自己的零花钱给小女生买了一束鲜花，小女生问小男生鲜花的数量:“这花多少束?”，
    通过键盘输入小男孩回答的鲜花的束数，数量不一样小女生的反应也不一样。如果鲜花数大于等于9999，打印："小女生直接晕了过去",
    如果在1000(包含)-9999(不包含)，打印："明天就结婚",如果在100(包含)-1000(不包含)，打印："拉拉手意思意思，有空再约！",
    否则：打印："你是个好人"
'''
# num = int(input('这花多少束:'))
# if num  >= 9999:
#     print('小女生直接晕了过去')
# elif num <9999 and num >= 1000:
#     print('明天就结婚')
# elif num <1000 and num >= 100:
#     print('拉拉手意思意思，有空再约！')
# else:
#     print('你是个好人')

'''
    3、输入三角形的三条边长，判断三角形的类型。
    根据实际情况分别打印：不能构成三角形，一般三角形，等腰三角形，等边三角形，只要能构成三角形，则还需要计算出：周长。
'''

'''
    4、如果输入三个不同的数，要求比较大小并按从小到大排序输出呢？如输出：a<b<c）
'''

'''
    5、判断输入的用户名为admin及密码为admin则打印登录成功，否则打印用户名或密码错误，登录失败
'''

'''
    6、判断输入的数是奇数还是偶数
'''

'''
    7、用户输入的年份是否为闰年
'''

'''
8、python实现石头剪刀布的游戏。
    1.从控制台输入要输出的拳--石头（1）剪刀2、布3
    2.电脑随机出拳--假定电脑只会出石头
    3.比较胜负
'''

'''
    9.判断某一个字典中是否存在指定的值，如果存在，提示并且退出循环；如果不存在，在循环整体结束后，得到一个统一的提示
    students=[{'name':'二狗','age':20,'height':1.7,'weight':75},{'name':'狗蛋','age':20,'height':1.7,'weight':75}]
'''

'''
    10.打印99乘法表
'''

'''
    11、打印如下图案：
    *
    **
    ***
    ****
    *****
'''

'''
    12、打印如下图案：
    *
    ***
    *****
    *******
    *********
'''

'''
13、打印如下图案：
    #####*
    ####***
    ###*****
    ##*******
    #*********
'''

'''
14、打印如下图案：
         *
        ***
       *****
      *******
     *********
      *******
       *****
        ***
         *
'''

'''
15、定义一个List，任意输入10个数字保存到List，然后按从小到大排序。（冒泡排序）
'''